<a href="https://colab.research.google.com/github/yumakemore/tokens/blob/master/Medication_Event2Concept.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Data I/O

In [0]:
import pandas as pd
import sys

# Create DataFrame
d = [1,2,3,4,5,6,7,8,9]
df = pd.DataFrame(d, columns = ['Number'])
df

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

Excel I/O

In [0]:
# Export to Excel
df.to_excel('Lesson10.xlsx', sheet_name = 'testing', index = False)
print('Done')

# Path to excel file
# Your path will be different, please modify the path below.
location = r'./Lesson10.xlsx'

# Parse the excel file
df = pd.read_excel(location, 0)
print(df.head(),"\n")
print(df.dtypes,"\n")
print(df.tail())

Done
   Number
0       1
1       2
2       3
3       4
4       5

Number    int64
dtype: object

   Number
4       5
5       6
6       7
7       8
8       9

In [0]:
# Path to excel file
# Your path will be different, please modify the path below.
location = r'./Lesson10.xlsx'

# Parse the excel file
df = pd.read_excel(location, 0)
df

   Number  Boolean     Name  Age
0       1        0      Tom   10
1       2        1      Sam   20
2       3        1     Jane   10
3       4        1   Murlas   55
4       5        0     Jane   14
5       6        1  Jackson   23
6       7        0     Bill   42
7       8        0     Greg   24
8       9        1      Tom    2

JSON I/O

In [0]:
df.to_json('Lesson10.json')
print('Done')

# Your path will be different, please modify the path below.
jsonloc = r'./Lesson10.json'

# read json file
df2 = pd.read_json(jsonloc)
print(df2.head(),"\n")
print(df2.dtypes,"\n")
print(df2.tail())

Database I/O

In [0]:
!pip install pymysql
#!pip install mysql-connector-python

import pandas as pd
d = [1,2,3,4,5,6,7,8,9]
df = pd.DataFrame(d, columns = ['Number'])
#---

# MySQL (used db4free)
from sqlalchemy import create_engine
import pymysql
#import mysql.connector

db_connection_str = 'mysql+pymysql://yu11111:111yu111@db4free.net:3306/yu_test_db'
engine = create_engine(db_connection_str)

df.to_sql("yu2", engine)
df = pd.read_sql('SELECT * FROM yu2', engine) #read_sql() is a wrapper of read_sql_table() and read_sql_query()
print(df)

# MS SQL through ODBC
'''
from sqlalchemy import create_engine
import pyodbc

db_connection_str = 'mssql+pyodbc://user:passwd@host/db_name'
engine = create_engine(db_connection_str)

df.to_sql("table_name", engine)
df = pd.read_sql('SELECT top 5 * FROM table_name', engine) #read_sql() is a wrapper of read_sql_table() and read_sql_query()
'''

Requirement already satisfied: pymysql in /usr/local/lib/python3.6/dist-packages (0.9.3)
   index  Number
0      0       1
1      1       2
2      2       3
3      3       4
4      4       5
5      5       6
6      6       7
7      7       8
8      8       9

'\nfrom sqlalchemy import create_engine\nimport pyodbc\n\ndb_connection_str = \'mssql+pyodbc://user:passwd@host/db_name\'\nengine = create_engine(db_connection_str)\n\ndf.to_sql("table_name", engine)\ndf = pd.read_sql(\'SELECT top 5 * FROM table_name\', engine) #read_sql() is a wrapper of read_sql_table() and read_sql_query()\n'